do
function run(msg, matches)
  if matches[1] == 'شناسه کاربر' then
return "#⃣درباره ی کاربر\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\nℹ️وضعیت∶شناسایی شده✔\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\n📍نام کوچک | "..msg.from.first_name.."\n📍فامیلی | "..msg.from.last_name.."\n📍نام کاربری | @"..msg.from.username.."\n📍شناسه | "..msg.from.id.."\n📍لینک کاربر | t.me/"..msg.from.username..""
end
  if matches[1] == 'شناسه گروه' then
return "#⃣درباره ی گروه\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\nℹ️وضعیت∶مدیریت شده✔\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\n📍نام گروه | "..msg.to.title.."\n📍شناسه | "..msg.to.id.."\n📍نام کاربری گروه | در منطقه شما مجاز نیست"  
end
  if matches[1] == 'شناسه پیام' then
return "#⃣درباره ی پیام\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\nℹ️وضعیت∶ارسال شده✔\n┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\n📍متن پیام | "..msg.text.."\n📍شناسه | "..msg.id..""
end
end
return {
  patterns = {
    "^(.*)$",
  },
  run = run
}
end
